app/views/shared/_found_cards.html.erb

<% @game = Game.find_by_user_id(current_user.id) %>
---
SELECT  "games".* FROM "games" WHERE "games"."user_id" = $1 LIMIT $2  [["user_id", 7], ["LIMIT", 1]]