app/controllers/card_sets_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT  "cards".* FROM "cards" WHERE "cards"."image_url" = $1 LIMIT $2  [["image_url", "dog_green_filled_1.png"], ["LIMIT", 1]]
INSERT INTO "card_sets" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-09-21 23:09:04.876717"], ["updated_at", "2017-09-21 23:09:04.876717"]]
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."card_id" = $1 AND "assignments"."game_id" = $2 LIMIT $3  [["card_id", 12], ["game_id", 18], ["LIMIT", 1]]
UPDATE "assignments" SET "card_status" = $1, "card_set_id" = $2, "updated_at" = $3 WHERE "assignments"."id" = $4  [["card_status", "in_set"], ["card_set_id", 13], ["updated_at", "2017-09-21 23:57:17.640890"], ["id", 1400]]
---
  def create
    game = Game.find(params[:game_id])

    respond_to do |format|
      format.html { redirect_to game_path(game) }
      format.json {
        card1 = Card.find_by(image_url: (params["cards"]["c1"].downcase.split(" ").join("_") + ".png"))
        card2 = Card.find_by(image_url: (params["cards"]["c2"].downcase.split(" ").join("_") + ".png"))
        card3 = Card.find_by(image_url: (params["cards"]["c3"].downcase.split(" ").join("_") + ".png"))

        cards = [card1, card2, card3]

        # if is_set?(cards)
        if cards.length == 3
          new_card_set = CardSet.create!()

          cards.each do |card|
            Assignment.find_by_card_id_and_game_id(card.id, game.id).update(card_status: "in_set", card_set_id: new_card_set.id)

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
          # end

          new_cards_json = {
            "1": "<img src='../assets/#{new_cards[0].card.image_url}' alt='#{new_cards[0].card.image_url.split(".").first.split("_").join(" ")}'>",
            "2": "<img src='../assets/#{new_cards[1].card.image_url}' alt='#{new_cards[1].card.image_url.split(".").first.split("_").join(" ")}'>",
            "3": "<img src='../assets/#{new_cards[2].card.image_url}' alt='#{new_cards[2].card.image_url.split(".").first.split("_").join(" ")}'>"