app/controllers/games_controller.rb

INSERT INTO "games" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2017-09-21 19:00:08.646444"], ["updated_at", "2017-09-21 19:00:08.646444"]]
SELECT "cards".* FROM "cards"
INSERT INTO "assignments" ("card_id", "game_id", "card_status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["card_id", 31], ["game_id", 2], ["card_status", "in_play"], ["created_at", "2017-09-21 19:00:08.697745"], ["updated_at", "2017-09-21 19:00:08.697745"]]
---
  def create
    game = Game.new(user_id: current_user.id)

    if game.save
      cards = Card.all
      board = cards.sample(12)
      deck = []

      cards.each do |card|
        if !board.include?(card)
          deck << card
        end
      end

      board.each do |card|
        game.assignments.create!(card_id: card.id, card_status: "in_play")