app/controllers/users_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."user_id" = $1 LIMIT $2  [["user_id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    @games = User.find(params[:id]).games